artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/todos"
          json:
            title: "Test"
            description: "Test description"
            completed: false
            created_at: "2023-06-09T12:00:00.000Z"